{
    "data": [
        {
            "id": "1",
            "title": "Harry Potter and the Philosopher's Stone",
            "author": "J. K. Rowling",
            "publicationDate": "26 June 1997",
            "genre": "Fantasy",
            "description": "Turning the envelope over, his hand trembling, Harry saw a purple wax seal bearing a coat of arms; a lion, an eagle, a badger and a snake surrounding a large letter 'H'.\nHARRY POTTER has never even heard of Hogwarts when the LETTERS start dropping on the doormat at number four, Privet Drive. Addressed in GREEN INK on yellowish parchment with a PURPLE SEAL, they are swiftly confiscated by his GRISLY aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called RUBEUS HAGRID bursts in with some ASTONISHING news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!",
            "coverImage": "https://i.pinimg.com/236x/30/c1/72/30c1720ea5d9c8efd7fa0883a572d27f.jpg"
        },
        {
            "id": "2",
            "title": "It Ends with Us",
            "author": "Colleen Hoover",
            "publicationDate": "02 August 2016",
            "genre": "Romance ",
            "description": "Based on the relationship between her mother and father, Hoover described it as \"the hardest book I've ever written\". It explores themes of domestic violence and emotional abuse.",
            "coverImage": "https://i.pinimg.com/736x/59/5d/b2/595db227133b3676ca6241098383b094.jpg"
        },
        {
            "id": "3",
            "title": "One of Us Is Lying",
            "author": "Karen M. McManus",
            "publicationDate": "29 May 2017",
            "genre": "Mystery ",
            "description": "Five Bayview High School students are in detention when one of the students, Simon, suddenly dies while the teacher is out of the room. After claims that this incident was no accident, the four remaining students in the detention all become suspects. Each of the four have motives.",
            "coverImage": "https://i.pinimg.com/236x/5c/00/35/5c0035f14a1faf0198132906754f6351.jpg"
        },
        {
            "id": "4",
            "title": "The Summer I Turned Pretty",
            "author": "Jenny Han",
            "publicationDate": "2009",
            "genre": "Romance ",
            "description": "Belly measures her life in summers. Everything good, everything magical happens between the months of June and August. Winters are simply a time to count the weeks until the next summer, a place away from the beach house, away from Susannah, and most importantly, away from Jeremiah and Conrad. They are the boys that Belly has known since her very first summer—they have been her brother figures, her crushes, and everything in between. But one summer, one terrible and wonderful summer, the more everything changes, the more it all ends up just the way it should have been all along.",
            "coverImage": "https://i.pinimg.com/236x/af/0d/3e/af0d3ee1400008d6ee7cec171e15e97b.jpg"
        },
        {
            "id": "5",
            "title": "The Bridgertons: Happily Ever After",
            "author": "Julia Quinn",
            "publicationDate": "02 April 2013",
            "genre": "Historical / Romance ",
            "description": "Now, with The Bridgertons: Happily Ever After, Julia Quinn delivers eight sexy, funny, and heartwarming “2nd Epilogues,” plus a bonus story about none other than the wise and witty Violet Bridgerton herself. So get to know the Bridgertons all over again—because Happily Ever After is a whole lot of fun.",
            "coverImage": "https://i.pinimg.com/736x/3b/39/0a/3b390af9409b57becd27c27e8285ef40.jpg"
        },
        {
            "id": "6",
            "title": "Daughter of the Moon Goddess",
            "author": "Sue Lynn Tan",
            "publicationDate": "11 January 2022",
            "genre": "Fantasy / Romance ",
            "description": "Daughter of the Moon Goddess begins an enchanting, romantic duology which weaves ancient Chinese mythology into a sweeping adventure of immortals and magic—where love vies with honor, dreams are fraught with betrayal, and hope emerges triumphant.",
            "coverImage": "https://i.pinimg.com/236x/38/be/b4/38beb4ef07f4b73a843eb480bcf827f0.jpg"
        },
        {
            "id": "7",
            "title": "Twisted Love",
            "author": "Ana Huang",
            "publicationDate": "21 April 2021",
            "genre": "Romance ",
            "description": "TWISTED LOVE tells the story of Ava, a free-spirited college student who finds herself under the overbearing protection of her brother's best friend, Alex, a handsome, cold-hearted millionaire bent on avenging his murdered family.",
            "coverImage": "https://i.pinimg.com/736x/4a/39/7d/4a397dff163619f7545367ec827ff57a.jpg"
        },
        {
            "id": "8",
            "title": "Dracula",
            "author": "Bram stoker",
            "publicationDate": "26 May 1897",
            "genre": "Horror",
            "description": "It has no single protagonist and opens with solicitor Jonathan Harker taking a business trip to stay at the castle of a Transylvanian nobleman, Count Dracula. Harker escapes the castle after discovering that Dracula is a vampire, and the Count moves to England and plagues the seaside town of Whitby.",
            "coverImage": "https://i.pinimg.com/736x/aa/fc/a4/aafca49777c04cd3cfc68ee775de35d2.jpg"
        },
        {
            "id": "9",
            "title": "Blood Brothers",
            "author": "Nora Roberts",
            "publicationDate": "27 November 2007",
            "genre": "Romance / Fiction",
            "description": "#1 New York Times bestselling author Nora Roberts presents the first novel in a compelling trilogy about three brothers bound by fate, blood, and a timeless enemy.In the town of Hawkins Hollow, it's called The Seven. Every seven years, on the seventh day of the seventh month, strange things happen. It began when three young boys--Caleb, Fox, and Gage--went on a camping trip to The Pagan Stone...",
            "coverImage": "https://i.pinimg.com/236x/89/31/5f/89315fb6f8a5070efd9370492ab1bdad.jpg"
        },
        {
            "id": "10",
            "title": "Ushers",
            "author": "Joe Hill",
            "publicationDate": "1 November 2024",
            "genre": "Fantasy",
            "description": "A young man who has improbably escaped death twice reveals his secret in a spine-tingling short story by New York Times bestselling author Joe Hill.\nMartin Lorensen is a twenty-three-year-old counselor for disturbed teenagers. He’s bright, compassionate, attractive, and outgoing. He’s also—and this is the most interesting thing—not dead. Martin has improbably survived not one but two deadly disasters that claimed dozens of lives. The kid is riding one hell of a lucky streak. Two federal agents think there is something darker at play. Now that they’ve arranged to interview Martin, they want answers. Martin is ready to share everything he knows. One thing is for certain: when it comes to escaping death, luck doesn’t figure into it at all.\n",
            "coverImage": "https://i.pinimg.com/736x/34/81/9a/34819a512718ec16bfd272c8ece6582f.jpg"
        },
        {
            "id": "11",
            "title": "The Very Secret Society of Irregular Witches",
            "author": "Sangu Mandanna",
            "publicationDate": "August 23, 2022",
            "genre": "Magical Realism",
            "description": "As one of the few witches in Britain, Mika Moon knows she has to hide her magic, keep her head down, and stay away from other witches so their powers don't mingle and draw attention. And as an orphan who lost her parents at a young age and was raised by strangers, she's used to being alone and she follows the rules...with one exception: an online account, where she posts videos pretending to be a witch. She thinks no one will take it seriously.",
            "coverImage": "https://i.pinimg.com/236x/59/89/69/598969739be5bbde148f26bb0c9afada.jpg"
        },
        {
            "id": "12",
            "title": "The Locked Door",
            "author": "Freida McFadden",
            "publicationDate": "June 1, 2021",
            "genre": "Mystery Thriller",
            "description": "Some doors are locked for a reason…\nWhile eleven-year-old Nora Davis was up in her bedroom doing homework, she had no idea her father was killing women in the basement.\nUntil the day the police arrived at their front door.\nDecades later, Nora’s father is spending his life behind bars, and Nora is a successful surgeon with a quiet, solitary existence. Nobody knows her father was a notorious serial killer. And she intends to keep it that way.\nThen Nora discovers one of her young female patients has been murdered. In the same unique and horrific manner that her father used to kill his victims.\nSomebody knows who Nora is. Somebody wants her to take the fall for this unthinkable crime. But she’s not a killer like her father. The police can’t pin anything on her.\nAs long as they don’t look in her basement.",
            "coverImage": "https://i.pinimg.com/736x/9a/b3/77/9ab377113b5985cb60a400af45754d56.jpg"
        },
        {
            "id": "13",
            "title": "The Death of Love",
            "author": "D.B. Tarpley",
            "publicationDate": "July 14, 2015",
            "genre": "Gothic",
            "description": "Join Mr. F, Penny, and Gnat as they continue to trek across Post-Zombie Apocalyptic America in search for a better life. This second volume of the Damned Hunger Chronicles finds all three of our protagonists going through uncharted territory when they stumble upon an underground military compound with darker secrets than the ground above. Will all three make it out alive? Will Mr. F find enough blood to satiate his baser needs? Will Penny find peace and acceptance in her role as Mr. F's eternal servant? Will ten year old Gnat have a religious epiphany and suddenly understand God and people's obsession with such before the powers within his fragile body bubble over and annihilate what is left of mankind? Or will their newfound hole in the ground swallow them whole, forever? read 'The Death of Love' to find the answers to these, and at least 4 other fascinating questions.",
            "coverImage": "https://i.pinimg.com/236x/c1/b8/8d/c1b88d3857ce42bdb33d33ccdd7e15fd.jpg"
        },
        {
            "id": "14",
            "title": "Carmilla",
            "author": "J. Sheridan Le Fanu, Karl Wurf",
            "publicationDate": "January 1, 1872",
            "genre": "Queer Horror",
            "description": "In an isolated castle deep in the Austrian forest, Laura leads a solitary life with only her ailing father for company. Until one moonlit night, a horse-drawn carriage crashes into view, carrying an unexpected guest – the beautiful Carmilla. So begins a feverish friendship between Laura and her mysterious, entrancing companion.But as Carmilla becomes increasingly strange and volatile, prone to eerie nocturnal wanderings, Laura finds herself tormented by nightmares and growing weaker by the day… Pre-dating Dracula by twenty-six years, Carmilla is the original vampire story, steeped in sexual tension and gothic romance.",
            "coverImage": "https://i.pinimg.com/236x/c5/c7/77/c5c77746b6757f2fe84c7e6e497c3ca3.jpg"
        },
        {
            "id": "15",
            "title": "Frankenstein: The 1818 Text",
            "author": "Mary Wollstonecraft Shelley, Charlotte Gordon",
            "publicationDate": "January 1, 1818",
            "genre": "Gothic",
            "description": "This is a previously-published edition of ISBN 9780143131847.\nMary Shelley's seminal novel of the scientist whose creation becomes a monster.\nThis edition is the original 1818 text, which preserves the hard-hitting and politically charged aspects of Shelley's original writing, as well as her unflinching wit and strong female voice. This edition also includes a new introduction and suggestions for further reading by author and Shelley expert Charlotte Gordon, literary excerpts and reviews selected by Gordon and a chronology and essay by preeminent Shelley scholar Charles E. Robinson.",
            "coverImage": "https://i.pinimg.com/236x/73/a8/49/73a84940e7f235f566ace0f496e17c57.jpg"
        },
        {
            "id": "16",
            "title": "Heir of Fire",
            "author": "Sarah J. Maas",
            "publicationDate": "September 2, 2014",
            "genre": "Magical",
            "description": "Celaena has survived deadly contests and shattering heartbreak-but at an unspeakable cost. Now, she must travel to a new land to confront her darkest truth . . . a truth about her heritage that could change her life-and her future-forever. Meanwhile, brutal and monstrous forces are gathering on the horizon, intent on enslaving her world. Will Celaena find the strength to not only fight her inner demons, but to take on the evil that is about to be unleashed?",
            "coverImage": "https://i.pinimg.com/236x/c6/e6/ab/c6e6ab47268f39d64fe4a17a7d582f67.jpg"
        }
    ]
}